import json

x = {
	"0":"高等代数 1学期",
	'1':"高等代数 2学期",
	"2":"数学分析 2学期",
	'3':'数学分析 3学期',

	"00":"高等代数",
	"10":'高等代数（1）',
	"11":"高等代数（2）",
	"20":"2数学分析（1）",
	"21":"2数学分析（2）",
	"30":"3数学分析（1）",
	"31":"3数学分析（2）",
	"32":"3数学分析（3）",
	"000":"期中考试",
	"001":"期末考试",
	"100":"期中考试",
	"101":"期末考试",
	"110":"章节测验（1）",
	"111":"章节测验（2）",
	"112":"期末考试",
	"200":"期中考试",
	"201":"期末考试",
	"210":"期中考试",
	"211":"期末考试",
	"300":"期中考试",
	"301":"期末考试",
	"310":"期中考试",
	"311":"期末考试",
	"320":"期中考试",
	"321":'期末考试'
}
y = {
	'course':['高等代数 1学期','高等代数 2学期','数学分析 2学期','数学分析 3学期'],
	'0':['高等代数'],
	"1":['高等代数（1）','高等代数（2）'],
	"2":['数学分析（1）','数学分析（2）'],
	"3":['数学分析（1）','数学分析（2）','数学分析（3）']
}
z = {
	'0':'客观题',
	'1':'主观题',
	'2':'附加题',
	'4':'平时成绩'
}
u = {
	'0':"学生信息",
	"1":'单科成绩',
	'2':"平时成绩",
	'3':'总成绩'
}
with open('./test.json', 'w') as f:
	f.write(json.dumps(y))






